package com.example.demo.enums;

import com.example.demo.entity.BaseEnum;

import java.util.HashMap;

/**
 * 系统错误定义
 *
 * @author Spark
 */
public enum ErrorCode implements BaseEnum {
    S000000("操作成功"), E000001("系统繁忙"), E000002("系统繁忙"), E000003("http请求媒体类型错误"), E000004("http请求body为空或参数解析错误"), E000005(
            "http请求无服务"), E000006("暂无访问权限"), E000007("输入参数错误"), E000008("登录超时，请重新登录"), E000009("写入缓存失败"), E000010(
            "读取缓存失败"), E000011("保存对象不能为空"), E000012("主键不能为空"), E000013("更新对象不能为空"), E000014("删除对象不能为空"), E000015(
            "无法软删除"), E000016("消息topic不能为空"), E000017("消息内容不能为空"), E000018("消息发送失败"), E000019("生成令牌失败"), E000020(
            "对象转型失败"), E000021("用户未登录"), E000022("网络异常，请重新登录"), E000023("用户在其他设备或其他网络登录"), E000024("客户端头信息错误"), E000025(
            "访问过于频繁"), E000026("黑名单IP不能请求"), E000027("字典表转换错误"), E000028("用户无权限操作此数据"), E000029("机构信息同步失败"), E000030(
            "用户信息同步失败"), E000031("文件传输失败"), E000032("存储过程执行失败"), E000033("获取EHR令牌失败"), E000034("EHR获取用户出错"), E000035(
            "生成令牌错误"), E000036("该账户未配置登录权限"), E000050("您的账号已在其他地方登录，请注意账号安全！"), E000060(
            "方法缺少必要参数QueryRange对象"), E000061("未分配数据权限"), E000062("查询范围配置错误"), E000063("文件过大，请重新上传"), E000064(
            "数据权限拦截异常！"), E000065("没有访问权限！"), E000666("身份过期，请重新登录"),


    E000101("新增定时任务失败"), E000102("调用其他服务异常"), E000103("调用message服务异常"), E000104("调用crawler服务异常"), E000105(
            "调用crmCust服务异常"), E000106("调用crmProject服务异常"), E000107("调用crmSell服务异常"), E000199("调用client服务异常"), E000108(
            "调用client服务异常"), E000109("调用fincBasic服务异常"), E000110("调用fincCbs服务异常"), E000111("调用fincData服务异常"), E000112(
            "调用fincCapital服务异常"), E000113("调用global服务异常"), E000114("调用hro服务异常"), E000115("调用init服务异常"), E000116(
            "调用sso服务异常"), E000117("调用user服务异常"), E000118("调用workFlow服务异常"), E000119("调用basic服务异常"), E000120(
            "调用sp服务异常"), E000121("调用agile服务异常"), E000122("调用smurfs务异常"), E000123("调用service服务异常"), E000124(
            "调用salary服务异常"), E000125("调用entryStaff服务异常"), E000126("调用workOrder服务异常"), E000127("调用social服务异常"), E000128(
            "调用zzz服务异常"), E000129("调用insurance服务异常"), E000130("调用enterprise服务异常"), E000131("调用account服务异常"), E000132(
            "调用project服务异常"),


    E000201("序列不存在"), E000202("序列转换错误"),

    E000301("目标字符串长度过短"), E000302("目标字符串长度过长"),

    ESSO001("手机号码不存在"), ESSO002("用户未设置密码登录"), ESSO003("请输入正确的密码"), ESSO004("用户状态不可用"), ESSO005("验证码错误或已过期"), ESSO006(
            "手机号码已被注册"), ESSO007("请选择机构"), ESSO008("机构不存在"), ESSO009("新密码不能和原密码相同"), ESSO010("企业名称已存在"), ESSO012(
            "岗位名已存在"), ESSO013("该角色下有成员，不能禁用角色"), ESSO014("该用户在本机构下未配置任何岗位"), ESSO015("角色名称不可重复"), ESSO016(
            "上级部门已停用，不能新增或编辑该机构，请先启用上级部门！"), ESSO021("手机号码已存在"), ESSO022("编辑跳转时，员工staffId不能为空"), ESSO023(
            "工号已存在"), ESSO024("保存异常"), ESSO025("不能操作该数据"), ESSO026("注册企业客户失败, 请联系管理员"), ESSO027(
            "注册企业客户失败, 请联系管理员"), ESSO028("注册企业客户失败, 请联系管理员"), ESSO029("注册企业客户失败, 请联系管理员"), ESSO030(
            "注册企业客户失败, 请联系管理员"), ESSO031("注册企业客户失败, 请联系管理员"), ESSO032("注册企业客户失败, 请联系管理员"), ESSO033(
            "注册企业客户失败, 请联系管理员"), ESSO034("注册企业客户失败, 请联系管理员"), ESSO035("注册企业客户失败, 请联系管理员"), ESSO036(
            "请将部门下当前员工转移至其他部门。再进行删除，并且转移员工所属部门后，由原来部门领导需要审批的事项，皆转移至对应部门领导账户名下、不允许删除根机构"), ESSO037("根机构不允许删除"), ESSO038(
            "BPO已存在"), ESSO039("请勿输入重复的部门名称"), ESSO040("机构及其子机构不存在"), ESSO041("请先删除该角色下的用户"), ESSO042("原密码错误"), ESSO043(
            "图形验证码错误或已失效"), ESSO044("手机号码格式不正确"), ESSO045("上级岗位已停用，不能新增或编辑该岗位，请先启用上级岗位！"), ESSO046(
            "短信验证码错误或已失效"), ESSO047("手机号码已存在"), ESSO048("请先删除该岗位员工"), ESSO049("岗位名称不能重复"), ESSO050("请先删除下级部门"), ESSO051(
            "请先删除该部门员工"), ESSO052("账号已冻结"), ESSO053("账号已冻结"), ESSO054("账号已冻结"), ESSO055("账号已冻结"), ESSO056(
            "账号已冻结"), ESSO057("账号已冻结"), ESSO058("账号已冻结"), ESSO059("账号已冻结"), ESSO060("租户信息不存在"), ESSO061(
            "用户信息不存在"), ESSO062("用户未配置角色"), ESSO063("令牌解析用户错误"), ESSO064("该账号未配置角色或菜单权限"), ESSO065(
            "新密码和原密码不能相同"), ESSO066("不能使用该密码"), ESSO067("请输入正确的原密码"), ESSO068("该租户未分配任何菜单权限"), ESSO069(
            "后台菜单列表未配置"), ESSO070("多租户后台信息未配置"), ESSO071("租户已冻结"), ESSO072("租户未开通权限"), ESSO073("新增用户出错"), ESSO099(
            "员工不存在，请输入正确的用户id"), ESSO110("验证码不能为空"), ESSO111("头信息platform参数错误"), ESSO112("必要参数为空"), ESSO113(
            "参数长度超出限制"), ESSO115("每天最多可获取10次验证码"), ESSO116("客户端登录类型参数错误"), ESSO117("该条记录已删除"), ESSO118(
            "对应角色不存在"), ESSO119("添加的员工不能为空"), ESSO200("请设置员工管理范围"), ESSO201("请先删除该角色下员工"),


    EGB0001("上级地址代码错误"),

    EBS0000("所选数据权限有误"), EBS0001("该角色不能删除"), EBS0002("该角色不能修改"), EBS0003("请选择权限管理的相关功能"), EBS0004("没有勾选读取列表"), EBS0005(
            "请先删除该岗位员工"), EBS0006("岗位名称不能重复"), EBS0007("该用户不能冻结"), EBS0008("该用户不能解冻"), EBSO009("请先删除下级部门"), EBSO010(
            "请先删除该部门员工"), EBS0011("所选数据权限有误"), EBS0012("账号已冻结，不能重置密码"), EBS0013("同一部门的下级部门名称不能重复"), EBS0014(
            "获取用户身份信息数据失败"),

    EXLS001("列值不能为空"), EXLS002("验证子类未进行初始化"), EXLS003("列名不能为空"), EXLS004("列值格式不正确"), EXLS005("Excel导入错误"), EXLS006(
            "Excel导出错误"), EXLS007("Excel导入模板类型非法"), EXLS008("Excel导出模板类型非法"), EXLS009("文件转换失败"), EXLS0010(
            "导入数据有误，请查看错误报告"), EXLS0011("已存在重复的Excel"), EXLS0012("Excel标题不符合要求"), EXLS0013("只支持xls、xlsx格式"), EXLS0014(
            "导入文件不能为空"), EXLS0015("导入模板有误"), EXLS0016("数据为空，请调整后重新导入"), EXLS0017("网络异常"), EXLS0018("Excel表头实体不能为空"),

    ES00001("日志topic不能为空"), ES00002("日志topic不在范围之内"),

    ESMS001("发送短信参数错误"), ESMS002("调用短信平台业务类型错误"), ESMS003("短信发送失败"), ESMS004("群发不能超过1000个"), ESMS005(
            "短信类型不正确"), ESMS006("获取短信状态出错"),

    EQXB001("工商校验失败，请联系业管支持人员"), EQXB101("Appkey无效"), EQXB102("账户欠费"), EQXB103("appkey被停用"), EQXB104("IP未授权"), EQXB105(
            "未授权调用该接口"), EQXB109("接口被停用"), EQXB201("查询无结果"), EQXB207("查询错误"), EQXB208("参数名错误或参数为空"), EQXB209(
            "接口查询异常"), EQXB213("调用次数超过今日额度限制"),


    ERY0001("入职增员接口调用失败"), ERY0002("入离职资料（入职）接口调用失败"), ERY0003("工作经历接口调用失败"), ERY0004("劳动合同接口调用失败"), ERY0005(
            "离职减员接口调用失败"), ERY0006("入离职资料（离职）接口调用失败"),

    ETC0001("识别失败"), ETC0002("身份证验证失败"), ETC0003("银行卡验证失败"), ETC0004("营业执照识别失败"), ETC0005("银行卡已存在"), ETC0006(
            "身份证反面识别失败"), ETC0007("身份证正面验证失败"),


    ETSG0001("签名转PDF失败"), ETSG0002("签名失败"),


    EFILE01("请选择要上传的文件"), EFILE02("文件上传错误"), EFILE03("文件不存在"), EFILE04("图片压缩失败"),


    EUSER01("请先填写身份证件信息"), EUSER02("银行卡最多3张"), EUSER03("银行卡验证失败"), EUSER04("银行卡已校验，不用修改"), EUSER05("银行卡不存在"), EUSER06(
            "数据不存在"), EUSER07("协议未更改"), EUSER08("离职协议已下发"), EUSER09("未进行身份验证"),

    EQB0101("E签宝HTTP接口调用失败"), EQB0001("身份证二要素校验调用失败"), EQB0011("身份证三要素校验调用失败"), EQB0021("银行卡三/四要素校验调用失败"), EQB0022(
            "E签宝组织（公司）注册失败"), EQB0023("E签宝生成组织（公司）印章失败"), EQB0024("已生成签章，请勿重复生成"),


    EFIN001("总到款金额需小于等于银行流水金额"), EFIN002("账单总金额小于认领总金额"), EFIN003("余额不足"), EFIN004("账单已拆款"), EFIN005(
            "到款金额大于账单明细金额"), EFIN006("账单到款金额小于账单明细总到款金额"), EFIN007("账单与银行流水无认领关系"), EFIN008(
            "账单ID与账单明细ID无关联关系"), EFIN009("账单已全部到款"), EFIN010("该状态付款申请无法修改"), EFIN011("该状态薪酬申请无法修改"), EFIN012(
            "账单未认款"), EFIN013("账单未到款"), EFIN014("付款账号不能为空"), EFIN015("开始时间不能大于截止时间"), EFIN016("客户已存在流水记录"), EFIN017(
            "客户无该银行账户白名单，无法认款"), EFIN018("结清金额大于银行流水金额"), EFIN019("结清金额大于未结清金额"), EFIN020("该公司已分配权限，请勿多次操作"), EFIN021(
            "付款白名单不存在"), EFIN022("付款方同时还对应XXXX客户，请将XXX客户认款类型设置为“人工认款”"), EFIN023("未知调账类型"), EFIN024(
            "账单到款金额必须大于拆款金额"), EFIN025("客户账户不存在"), EFIN026("客户存在业务往来，不可删除！"), EFIN027(
            "客户的付款白名单对应多个客户，且已有其他客户自动认款，此客户不可设置为自动认款!"), EFIN028("分配公司代码记录不存在！"), EFIN029("冻结状态下不能修改！"), EFIN030(
            "该客户的付款白名单已存在，请勿重复添加"), EFIN031("非代付不能删除！"), EFIN032("分配公司代码记录已存在，请勿多次操作"), EFIN033(
            "XXX（代付方名称+付款方账号）的代付有效期到XXX年XX月XX日，不可在此期间新增相同代付！"), EFIN034("实缴明细存在多条同一类型记录"), EFIN035(
            "实缴明细已部分清账或清账"), EFIN036("实缴明细差异处理中或处理成功"), EFIN037("账单部分清账或已清账"), EFIN038("账单已存在核销记录"), EFIN039(
            "实缴明细存在多条差异记录"), EFIN040("实缴汇总记录存在多条记录"), EFIN041("账单明细已核销"), EFIN042("用户可用余额不足"), EFIN043(
            "取消到款认款金额小于0"), EFIN044("账户与银行流水无认领关系"), EFIN045("账单正在审核中，不能认款"), EFIN046("账单明细金额负差，不能拆款"), EFIN047(
            "账单明细金额负差，不能取消拆款"), EFIN048("负数账单明细为空，不能审批"), EFIN049("账单正在审核中，不能拆款"), EFIN050("账单审核过程出现异常"), EFIN051(
            "该账单审批中或审批通过，不可再次提交审批"), EFIN052("该流程审批已结束"), EFIN053("负数账单金额不能执行自动拆款"), EFIN054("当前状态不可操作"), EFIN055(
            "负账单撤销失败"), EFIN056("负账单撤销记录不存在"), EFIN057("需要撤销的负订单不存在"), EFIN058("流程未终止的或非余额不足撤回失败的负账单不可再操作"), EFIN059(
            "无法撤销已经撤回成功的负账单"), EFIN060("负账单垫款撤回操作失败，余额依然不足"), EFIN061("非审核成功的负账单不能撤回"), EFIN062(
            "负账撤销单垫发生未知审批状态和审批结果"), EFIN063("负账撤销单垫审批流程终止失败"), EFIN064("负账撤销单垫审批流程不存在"), EFIN065(
            "只能终止审批中的记录或驳回的记录"), EFIN066("未能查询到审批详情"), EFIN067("负账单垫款撤回操作失败"), EFIN068("负账单垫款操作失败"), EFIN069(
            "负账单明细不存在"), EFIN070("负账单不存在"), EFIN071("正数账单已经拆款"), EFIN072("财务设置账户冻结/解冻操作异常"), EFIN073(
            "处理冻结/解冻流程审批接口异常"), EFIN074("垫款金额不能超出账单金额"), EFIN075("该客户余额账户已存在"), EFIN076("该客户余额配置已存在"), EFIN077(
            "调账记录不存在"), EFIN078("审批通过或审批中不可重复发起审批"), EFIN079("垫款不能为负数"), EFIN080("流程不存在"), EFIN081(
            "账户配置信息不存在"), EFIN082("账单余额信息不存在"), EFIN083("该账户冻结/解冻流程，不存在审核信息"), EFIN084("账户详情不存在"), EFIN085(
            "账单信息不存在"), EFIN086("处理冻结/解冻流程审批接口异常"), EFIN087("发起账户冻结审批流接口异常"), EFIN088("终止账户冻结/解冻流程异常"), EFIN089(
            "会员费不允许垫款"), EFIN090("无可用垫款"),

    EFINANCE001("账单已经生成且生效，不可重复生成"), EFINANCE002("参保信息不存在"), EFINANCE003("参保信息中的订单信息不存在"), EFINANCE004(
            "订单信息不存在"), EFINANCE005("账单类型不存在"), EFINANCE006("体检参保信息明细不存在"), EFINANCE007("商保参保信息明细不存在"), EFINANCE008(
            "薪税参保信息明细不存在"), EFINANCE009("服务费计算规则不存在"), EFINANCE010("季节不存在"), EFINANCE011("风险金计算规则不存在"), EFINANCE012(
            "社保参保信息明细不存在"), EFINANCE013("账单类目不存在"), EFINANCE014("账单总额累加错误"), EFINANCE015("账单生成发生异常"), EFINANCE016(
            "账单生成超时异常"), EFINANCE017("获取政策包下其他收费类目异常"), EFINANCE018("其他费用计算规则不存在"), EFINANCE019("账单不存在"), EFINANCE020(
            "账单已经作废"), EFINANCE021("取消的账单必须是未认款"), EFINANCE022("账单详情不存在"), EFINANCE023("已有账单详情被认款,无法作废账单"), EFINANCE024(
            "风险金账单类型不存在"), EFINANCE025("服务费账单类型不存在"), EFINANCE026("若生成负账单，账单必须是未认款"), EFINANCE027(
            "该账单下此雇员账单详情不存在"), EFINANCE028("查询crm税率异常"), EFINANCE029("没有查询到账单"), EFINANCE030("存在账单已经认款"), EFINANCE031(
            "认款账户配置不存在"), EFINANCE032("薪税账单有误，没有薪税参保记录"), EFINANCE033("体检账单有误，没有体检参保记录"), EFINANCE034(
            "商保账单有误，没有商保参保记录"), EFINANCE035("社保账单有误，没有社保参保记录"), EFINANCE036("没有查询到对应的账单信息"), EFINANCE037(
            "账单对应的参保记录有误"), EFINANCE038("没有账单需要生成"), EFINANCE039("当前账单不是负账单，无法审核"), EFINANCE040(
            "计算账单认款状态异常"), EFINANCE041("认款操作只能针对同一账单下的明细"), EFINANCE042("认款金额不能为0"), EFINANCE043(
            "当前账单没有明细"), EFINANCE044("统计账单明细已认款总金额发生异常"), EFINANCE045("账单取消认款失败"), EFINANCE046("流水生成失败"), EFINANCE047(
            "没有账单需要生成"), EFINANCE048("薪税账单有误，没有薪税参保记录"), EFINANCE049("体检账单有误，没有体检参保记录"), EFINANCE050(
            "商保账单有误，没有商保参保记录"), EFINANCE051("社保账单有误，没有社保参保记录"), EFINANCE052("没有查询到对应的账单信息"), EFINANCE053(
            "账单对应的参保记录有误"), EFINANCE054("垫款金额不能小于0"), EFINANCE055("账单垫款异常，没有发生金额变动"), EFINANCE056("该账单类目没有对应的余额认款项目"),


    EFINANCE057("修改账单审批流程不存在"), EFINANCE058("修改账单审批流程只能终止审批中的记录"), EFINANCE059("修改账单审批,无法对已经终止的流程进行操作"), EFINANCE060(
            "修改账单审批流程发生未知审批状态和审批结果"), EFINANCE061("账单没有进行财务配置，无法审核"), EFINANCE062("修改账单审批流程终止有误"), EFINANCE063(
            "负账单审批流程终止有误"), EFINANCE064("负账单审批流程不存在"), EFINANCE065("负账单审批流程只能终止审批中的记录"), EFINANCE066(
            "账户信息不存在"), EFINANCE067("账单垫款结清异常"), EFINANCE068("请款垫款结清异常"), EFINANCE069("实缴垫款结清异常"), EFINANCE070(
            "质保金补足异常"), EFINANCE071("风险押金补足异常"), EFINANCE072("余额到款异常"), EFINANCE073("账户信息不存在或冻结"), EFINANCE074(
            "账户信息账单已经申请开票或冻结"), EFINANCE075("银行流水暂无到款关系"), EFINANCE076("账单已经全部认款"), EFINANCE077(
            "增加已开票减少未开票异常"), EFINANCE078("减少已开票增加未开票异常"), EFINANCE079("预开票开票异常"), EFINANCE080("预开票未认款异常"), EFINANCE081(
            "预开票已全部认款异常"), EFINANCE082("减少未开票异常"), EFINANCE083("增加已开票异常"), EFINANCE084("增加已未票异常"), EFINANCE085(
            "减少预开票异常"), EFINANCE086("增加预开票减少已开票异常"), EFINANCE087("取消认款时需要先取消均摊到人的费用"), EFINANCE088(
            "账单认款失败，请检查余额是否充足"), EFINANCE089("该费用已设置，请勿重复提交"), EFINANCE090("开票费用设置不存在"), EFINANCE091(
            "账户余额不足，但是加上合同质保金后足以认款"), EFINANCE092("订单明细中存在预开票或预开票流程中数据，请先退票才可处理取消服务。"), EFINANCE093(
            "确认是否需要开全额的发票?"), EFINANCE094("请先终止开票流程！"), EFINANCE095("当前存在开票中的费用，不可直接退余额，请先撤回开票申请后再退费！"), EFINANCE096(
            "当前存在开票中的费用，不可直接退余额，请先联系财务确定实际开票情况，如已开票，请先退票再退费！"), EFINANCE097("不存在已开票科目的账单！"), EFINANCE098(
            "当前订单明细中存在未生成账单数据！"),EFINANCE099("服务费账单未认款"),EFINANCE100("质保金账单未认款"),

    EWEB001("查询文章不存在"), EWEB002("该活动不存在"), EWEB003("查询文章失败"), EWEB004("该类型下没有活动"), EWEB005("您已经报名，重复报名无效"), EWEB006(
            "最多可设置5个文章关键词"), EWEB007("最多可设置5个SEO关键词"),


    ECRM001("HRO同步失败"), ECMR002("启信宝无法查询到该企业"), ECMR003("商机编号不能为空"), ECMR004("商机不能分享给自己"), ECMR005("商机不能重复分享"), ECMR006(
            "该客户的业务类型商机受保护，只能创建一个此业务类型的商机"), ECRM007("该身份证号已存在"), ECMR008("该客户的业务类型商机受保护，只能创建一个此业务类型的商机"), ECMR009(
            "该客户已存在,无法变更"), ECRM010("身份证号不能为空"), ECRM011("主合同不存在"), ECRM012("启动函商机不能重复"), ECMR013(
            "该客户的业务类型商机已开启保护，不可重复创建"), ECMR014("套餐已存在，不能重复创建"), ECMR015("已有同类型业务，不能重复创建"), ECMR016(
            "您无法创建此业务类型商机"), ECMR017("抱歉合同已经是失效或未生效状态"), ECMR018("修改主合同信息商机ID不能为空"), ECMR019(
            "当前合同有补充合同审批未结束，请先终止补充合同流程"), ECMR020("当前商机无法编辑"), ECMR021("无法获取当前登录者名称"), ECMR022("必填金柚小蜜报价服务"), ECMR023(
            "线索名称不可重复"), ECMR024("关联类型名称已存在，请勿重复创建！"), ECMR031("合同编号不存在"), ECMR055("已发布的系统任务无法变更为非系统任务"), ECMR056(
            "已导入对象无法变更为系统任务"), ECRM025("统一信用代码重复，客户创建失败"), ECRM026("数据不存在"), ECRM027("暂无查看该数据的权限"),


    WF00001("不是流程发起人无法终止流程"), WF00002("流程不存在"), WF00003("流程已结束或已终止，不可进行审批处理操作"), WF00004("审批选择有误，请重新选择"),

    EAG0001("任务已结束/已终止"), EAG0002("任务已发布"), EAG0003("已发布的任务可以终止"), EAG0004("已有人接单，不能删除"), EAG0005(
            "已接单的订单可以终止"), EAG0006("请选择终止时间"), EAG0007("请先导入发布对象"), EAG0008("用户已确认，不能修改"), EAG0009("服务费已发放"), EAG0010(
            "部分服务费已发放，请重新选择"), EAG0011("已确认的服务费可以作废"), EAG0012("用户已确认，不能删除"), EAG0013("该用户已冻结"), EAG0014(
            "该用户账号正常，不用解冻"), EAG0015("暂无数据"), EAG0016("签名异常"), EAG0017("订单不存在"), EAG0018("任务未开始"), EAG0019(
            "任务已结束"), EAG0020("账户已冻结"), EAG0021("PDF转换异常"), EAG0022("用户已接单"), EAG0023("用户已确认服务费"), EAG0024(
            "公司章不存在"), EAG0025("身份证号码已存在"), EAG0026("银行卡添加失败"), EAG0027("该用户下无此账户"), EAG0028("用户未注册"), EAG0029(
            "该身份证号已认证"), EAG0030("该用户已实名"), EAG0031("用户未登录"), EAG0032("用户数据不存在"), EAG0033("网络异常，查询用户数据失败"), EAG0034(
            "暂不满足接单条件"), EAG0040("该用户正在认证中"), EAG0041("实名认证正面识别失败"), EAG0042("身份证实名认证失败"), EAG0043("身份证注册失败"), EAG0044(
            "实名认证反面识别失败"), EAG0045("该用户认证失败"),
	/*重复ECMR022("必填金柚小蜜报价服务"),
	ECMR023("线索名称不可重复"),
	WF00001("不是流程发起人无法终止流程")*/

    EAG0046("协议内容已变更，请重新签署"),
    //EAG0047("该用户认证失败"),

    ESER0001("服务类型+险种分类+险种名称 重复"), ESER0002("地区+排序 重复"), ESER0003("险种已生效,不可生效"), ESER0004("险种待生效或已失效,不可失效"), ESER0005(
            "服务方无法识别"), ESER0006("服务方请款账户重复"), ESER0007("账户对应名称错误"), ESER0008("账户对应银行错误"), ESER0009(
            "请款账户已生效,不可生效"), ESER0010("请款账户待生效或已失效,不可失效"), ESER0011("生效的政策包名称不可全局重复"), ESER0012(
            "非单立户时,服务网点名称不可为空"), ESER0013("男性参保年龄范围应在18-60之间"), ESER0014("女性参保年龄范围应在18-55之间"), ESER0015(
            "参保结束年龄应该大于参保起始年龄"), ESER0016("险种政策已存在，不可重复添加"), ESER0017("政策包险种最多只能创建999条"), ESER0018("状态传递不合法"), ESER0019(
            "户籍性质至少要有一个"), ESER0020("政策包已提交过审核"), ESER0021("只可操作状态为【待审批】的政策包"), ESER0022(
            "女性参保结束年龄应该大于参保起始年龄"), ESER0023("只可操作状态为【启用】险种政策"), ESER0024(
            "批量调整只适合【收费频率】=【按月】，【计算规则】=【按基数比例】的情况"), ESER0025("选择在职补收时，补缴类型为必填"), ESER0026(
            "调基预估,则调基开始年月和调基结束年月都为必填"), ESER0027("按季,需要输入4个收费月"), ESER0028("按半年,需要输入2个收费月"), ESER0029(
            "按年,只需要输入1个收费月"), ESER0030("启用后的险种政策才可禁用"), ESER0031("该险种政策没有对应月缴数据"), ESER0032("生效的政策包才可以失效"), ESER0034(
            "只可对生效或失效政策包复制"), ESER0035("该政策包已复制，当天不可再复制"), ESER0036("政策包名称过长,不可再复制"), ESER0037("状态禁用方可启用"), ESER0038(
            "状态启用方可禁用"), ESER0039("服务类型传递不合法"), ESER0040("二次请款账户对应险种分类不可为空"), ESER0041(
            "一个地区同一时间只能有一个生效的单立户政策包"), ESER0042("其他费用征收规则费用类型重复"), ESER0043("请款账户必须是数字"), ESER0044(
            "一个服务网点同一时间只有一个生效的非单立户政策包"), ESER0045("年月解析错误"), ESER0046("起缴月时间小于等于停缴月"), ESER0047("年月解析错误"), ESER0048(
            "雇员出生日期解析错误"), ESER0049("同客户不可同时下单"), ESER0050("企缴个缴比例不存在"), ESER0051("起缴年月应该小于等于当前下单年月"), ESER0052(
            "实际起缴年月应该小于等于实际停缴年月"), ESER0053("实际起缴年月应该小于等于停缴年月"), ESER0054("社保局已减员，不可撤回"), ESER0055(
            "社保批量操作时，存在重复雇员"), ESER0056("账单生成接口调用失败"), ESER0057("关联付费客户合同列表接口调用失败"), ESER0058(
            "允许不一致但当公积金基数大于社保五险的最低基数时必须一致"), ESER0059("公积金基数与社保五险的基数必须一致"), ESER0060(
            "必须一致但当社保公积金均按最高基数缴纳时允许不一致"), ESER0061("追溯账单时，必须要有完整的追溯时间段"), ESER0062(
            "旧政策包，在追溯时间段内没有新参或续保（续参）参保记录"), ESER0063("政策包调整追溯未生成对应的参保信息"), ESER0064("政策包调整追溯未生成对应的参保记录"), ESER0065(
            "当前政策包以追溯或正在追溯"), ESER0066("政策包调整没有需要追溯的险种"), ESER0067("已撤回无法重复提交"), ESER0068(
            "季缴年缴订单明细实际起缴月不应该小于社保定时任务权益月"), ESER0069("已存在订单明细无法修改收费频率，增员规则，减员规则"), ESER0080(
            "后一个时间必须晚于等于前一个时间"), ESER0081("网点类型不能为空"), ESER0082("服务网点ID不能为空"), ESER0083("请款数据不存在"), ESER0084(
            "后一个金额必须大于等于前一个金额"), ESER0085("期望付款时间值必须晚于或等于当前日期"), ESER0086("一次请款社保备用金合计，必须大于所有二次请款社保备用金合计的总额"), ESER0087(
            "一次请款公积金备用金合计，必须大于所有二次请款公积金备用金合计的总额"), ESER0088("一次请款残保金备用金合计，必须大于所有二次请款残保金备用金合计的总额"), ESER0089(
            "一次请款其他费用备用金合计，必须大于所有二次请款其他费用备用金合计的总额"), ESER0090("一次请款服务费备用金合计，必须大于所有二次请款服务费备用金合计的总额"), ESER0091(
            "所有二次请款社保备用金合计的总额，必须小于一次请款社保备用金合计"), ESER0092("所有二次请款公积金备用金合计的总额，必须小于一次请款公积金备用金合计"), ESER0093(
            "所有二次请款残保金备用金合计的总额，必须小于一次请款残保金备用金合计"), ESER0094("所有二次请款其他费用备用金合计的总额，必须小于一次请款其他费用备用金合计"), ESER0095(
            "所有二次请款服务费备用金合计的总额，必须小于一次请款服务费备用金合计"), ESER0096("一次请款单未发起审批，请到一次请款单编辑页合并发起审批"), ESER0097(
            "所有二次请款社保合计的总额，必须小于一次请款社保合计金额"), ESER0098("所有二次请款公积金合计的总额，必须小于一次请款公积金合计金额"), ESER0099(
            "所有二次请款残保金合计的总额，必须小于一次请款残保金合计金额"), ESER0100("所有二次请款其他费用合计的总额，必须小于一次请款其他费用合计金额"), ESER0101(
            "所有二次请款服务费合计的总额，必须小于一次请款服务费合计金额"), ESER0102("服务商合同中，对应的险种类别报价不存在，请检查服务商合同数据"), ESER0103(
            "请款金额必须大于0，才能发起审批"), ESER0104("雇员的参保类型不存在"), ESER0105("您没有当前账单月的请款权限！"), ESER0106(
            "您没有当前服务网点的请款权限！"), ESER0107("您没有当前服务网点或账单月的请款权限！"), ESER0108("服务商合同中，对应的地区报价不存在，请检查服务商合同数据"), ESER0109(
            "该人员已有部分险种办理完成，不支持撤回派单"), ESER0110("该服务商公司合同不在有效期内或该服务公司存在多条数据"),

    ESER0111("前端传递服务类型有误"), ESER0112("获取银行接口调用失败"), ESER0118("系统当天政策包已存在多个版本号,请第2天再操作"), ESER0119(
            "系统当天政策包新增编号超过设置范围,请重试或第二天再操作"),

    ESER0130("后道部门配置，最多支持导出1000条数据"), ESER0131("后道部门配置，最多支持1000条数据批量导入"), ESER0132("后道部门配置，最多支持1000条数据批量修改"), ESER0133(
            "后道部门配置数据不存在"), ESER0134("表内的服务网点名称存在重复"), ESER0135("导入文件格式有误"),

    //开票
    EINVOICE001("产品名称查询不到"), EINVOICE002("签约主体查询不到"), EINVOICE003("获取套餐接口调用失败"), EINVOICE004(
            "获取签约主体接口调用失败"), EINVOICE005("获取客户接口调用失败"), EINVOICE006("客户名称查询不到"), EINVOICE007("获取不到退票签收状态"), EINVOICE008(
            "获取员工接口调用失败"), EINVOICE009("获取快递公司接口调用失败"), EINVOICE010("未知字典状态"),

    EGW0001("历史活动不能导出二维码"), EGW0010("您已完成注册，请使用该手机号码直接登录"), EGW0011("仅超级管理员支持修改姓名"), EGWO012("企业账号已冻结"), EGWO013(
            "客户信息查询失败"),

    ESM0001("该合同公司不存在"), ESM0002("该工作单位不存在"), ESM0003("当前工作单位有关联的员工，无法删除"), ESM0004("工作单位已存在"), ESM0005(
            "该公司关联合同已签订，无法删除"), ESM0006("当前合同公司有关联的工作单位，无法删除"), ESM0007("请先进行入职登记完善资料信息！"), ESM0008(
            "最少要有一份合同"), ESM0009("用户未实名认证"), ESM0010("身份识别失败"), ESM0013("合同状态不正确"), ESM0014("签名异常"), ESM0015(
            "暂无数据"), ESM0016("公司章不存在"), ESM0017("企业信息修改不成功"), ESM0018("企业信息注册不成功"), ESM0019("生成企业印章不成功"), ESM0020(
            "该工作单位关联的合同公司已生效，无法修改"), ESM0021("公司名称重复"), ESM0022("统一社会信用代码重复"),


    EENT0001("为避免对员工造成骚扰，每日最多发送2次，已达到当日最大限制。"), EENT0002("短信邮件通知服务异常"),

    SCO0001("截点设置不能与已存在的申请一致"), SCO0002("截点设置不能跨月时截止时间类型只能是本月类型"), SCO0003("认款截止时间应该晚于报增截止时间"), SCO0004(
            "到款截止时间应该晚于报减截止时间"), SCO0005("派单截止时间应该晚于认款截止时间"), SCO0006("材料截止时间应该晚于派单截止时间"), SCO0007(
            "生效开始日期不能晚于生效结束日期"), SCO0008("生效开始日期不能早于当前日期"), SCO0009("截点设置仅可通过待审核状态"), SCO00010(
            "截点设置仅待审核和审核不通过状态可修改"), SCO00011("截点设置仅待审核状态可以不通过"), SCO00012("截点设置仅生效状态可以终止"), SCO00013(
            "临时截点设置仅待审核或不通过状态可以修改"), CO00014("临时截点设置仅待审核状态可以通过"), CO00015("临时截点设置仅待审核状态可以不通过"), CO00016(
            "临时截点设置仅生效状态可以失效"), SCO00017("后道参保截止时间应该晚于派单截止时间"),

    WO0001("工单仅为暂存状态时可编辑"), WO0008("新增工单状态仅可为暂存或待受理"), WO0002("工单为待受理或受理中状态时可撤回"), WO0004("工单为待受理状态时可受理"), WO0005(
            "工单为待受理状态时可转移"), WO0009("工单为受理中状态时可转移"), WO0006("不可转移给自己"), WO0007("工单为处理中状态时可处理"), WO0003("工单仅为暂存状态时可删除"),

    EETP0001("开票日期 不能为空"), EETP0002("收票人邮箱 不能为空"), EETP0003("收票人邮箱 邮箱格式不正确"), EETP0004("收票人地址 不能为空"), EETP0005(
            "必要参数不能为空"),


    EBSN0001("编码规则解析异常"), EBSN0002("编码规则序列号生成异常"), EBSN0003("编码规则序列号长度超出指定长度"), EBSN0004("麒麟系统业务编码生成异常"), EBSN0005(
            "麒麟系统业务编码生成异常，同一规则请求太频繁");


    private static HashMap<String, String> items;

    private static void putItem(ErrorCode item) {
        if (items == null) {
            items = new HashMap<>();
        }
        items.put(item.getCode(), item.getDesc());
    }

    public static String valueOfName(String name) {
        if (items.containsKey(name)) {
            return items.get(name);
        }
        return "参数超出范围";
    }

    public static boolean hasEnumName(String name) {
        return items.containsKey(name);
    }

    private String desc = null;

    ErrorCode(String desc) {
        this.desc = desc;
        putItem(this);
    }

    @Override
    public String getCode() {
        return this.name();
    }

    @Override
    public String getDesc() {
        return desc;
    }

    public boolean equals(String name) {
        if (name != null && name.equals(this.name())) {
            return true;
        }
        return false;
    }
}
